Secalot/secalot.firmware/platform/mk82/src/usb/mk82Usb.c
/*
 * Secalot firmware.
 * Copyright (c) 2017 Matvey Mukha <matvey.mukha@gmail.com>
 *
 * This Source Code Form is subject to the terms of the Mozilla Public
 * License, v. 2.0. If a copy of the MPL was not distributed with this
 * file, You can obtain one at http://mozilla.org/MPL/2.0/.
 */

/*
 * Copyright (c) 2013 - 2015, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "mk82Global.h"
#include "mk82GlobalInt.h"
#include "mk82System.h"
#include "mk82Usb.h"
#include "mk82UsbInt.h"

#include "fsl_device_registers.h"
#include "fsl_mpu.h"
#include "fsl_pit.h"

#include "usb_device_config.h"
#include "usb.h"
#include "usb_device.h"
#include "usb_device_ch9.h"

#include "mk82USBDeviceDescriptor.h"
#include "ccidGlobal.h"
#include "ccidCore.h"

#ifdef FIRMWARE
#include "opgpGlobal.h"
#include "opgpCore.h"

#include "sfGlobal.h"
#include "sfHid.h"

#include "btcGlobal.h"
#include "btcHid.h"
#endif /* FIRMWARE */

static usb_status_t USB_DeviceCcidBulkIn(usb_device_handle handle,
                                         usb_device_endpoint_callback_message_struct_t *message, void *callbackParam);
static usb_status_t USB_DeviceCcidBulkOut(usb_device_handle handle,
                                          usb_device_endpoint_callback_message_struct_t *message, void *callbackParam);
#ifdef FIRMWARE
static usb_status_t USB_DeviceU2fInterruptIn(usb_device_handle handle,
                                             usb_device_endpoint_callback_message_struct_t *message,
                                             void *callbackParam);
static usb_status_t USB_DeviceU2fInterruptOut(usb_device_handle handle,
                                              usb_device_endpoint_callback_message_struct_t *message,
                                              void *callbackParam);
static usb_status_t USB_DeviceKeyboardInterruptIn(usb_device_handle handle,
                                                  usb_device_endpoint_callback_message_struct_t *message,
                                                  void *callbackParam);
static usb_status_t USB_DeviceBtcInterruptOut(usb_device_handle handle,
                                              usb_device_endpoint_callback_message_struct_t *message,
                                              void *callbackParam);
#endif /* FIRMWARE */

static void mk82UsbFatalError(void);
static void mk82UsbCcidSendDataBlocking(uint8_t *buffer, uint32_t bufferLength);
#ifdef FIRMWARE
static void mk82UsbU2fSendPacketBlocking(void);
static void mk82UsbKeyboardSendPacketBlocking(void);
static void mk82UsbBtcSendPacketBlocking(void);
#endif /* FIRMWARE */
static uint16_t mk82UsbCheckForAnEvent(void);

static CCID_CORE_HANDLE mk82UsbCcidHandle;
static usb_device_handle mk82UsbDeviceHandle;
static uint8_t mk82UsbCcidPacketBuffer[MK82_USB_CCID_BULK_ENDPOINTS_PACKET_SIZE];
static uint8_t mk82UsbCcidDataBuffer[CCID_MAX_MESSAGE_LENGTH];
static volatile uint16_t mk82UsbCcidDataSent = MK82_FALSE;
static volatile uint16_t mk82UsbCcidPacketReceived = MK82_FALSE;
static uint32_t mk82UsbCcidReceivedPacketLength = 0;

#ifdef FIRMWARE
static uint8_t mk82UsbU2fHidDataBuffer[SF_HID_MAX_DATA_SIZE];
static SF_HID_HANDLE mk82UsbSfHidHandle;
static uint8_t mk82UsbU2fIncomingPacketBuffer[MK82_USB_U2F_INTERRUPT_ENDPOINTS_PACKET_SIZE];
static uint8_t mk82UsbU2fOutgoingPacketBuffer[MK82_USB_U2F_INTERRUPT_ENDPOINTS_PACKET_SIZE];
static volatile uint16_t mk82UsbU2fPacketSent = MK82_FALSE;
static volatile uint16_t mk82UsbU2fPacketReceived = MK82_FALSE;
static volatile uint16_t mk82UsbU2fTimerExpired = MK82_FALSE;

static uint8_t mk82UsbKeyboardOutgoingPacketBuffer[MK82_USB_KBD_INTERRUPT_ENDPOINT_PACKET_SIZE];
static volatile uint16_t mk82UsbKeyboardPacketSent = MK82_FALSE;

static uint8_t mk82UsbBtcHidDataBuffer[BTC_HID_MAX_DATA_SIZE];
static BTC_HID_HANDLE mk82UsbBtcHidHandle;
static uint8_t mk82UsbBtcIncomingPacketBuffer[MK82_USB_BTC_INTERRUPT_ENDPOINTS_PACKET_SIZE];
static uint8_t mk82UsbBtcOutgoingPacketBuffer[MK82_USB_BTC_INTERRUPT_ENDPOINTS_PACKET_SIZE];
static volatile uint16_t mk82UsbBtcPacketSent = MK82_FALSE;
static volatile uint16_t mk82UsbBtcPacketReceived = MK82_FALSE;
#endif /* FIRMWARE */

#ifdef FIRMWARE
static const uint8_t mk82UsbKeyboardKeyTable[] = {
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x2A, 0x00, 0x00, 0x00, 0x00, 0x28, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x29, 0x00, 0x00, 0x00, 0x00, 0x2c, 0x1e, 0x34, 0x20, 0x21, 0x22,
    0x24, 0x34, 0x26, 0x27, 0x25, 0x2e, 0x36, 0x2d, 0x37, 0x38, 0x27, 0x1e, 0x1f, 0x20, 0x21, 0x22, 0x23, 0x24, 0x25,
    0x26, 0x33, 0x33, 0x36, 0x2e, 0x37, 0x38, 0x1f, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0a, 0x0b, 0x0c, 0x0d, 0x0e,
    0x0f, 0x10, 0x11, 0x12, 0x13, 0x14, 0x15, 0x16, 0x17, 0x18, 0x19, 0x1a, 0x1b, 0x1c, 0x1d, 0x2f, 0x31, 0x30, 0x23,
    0x2d, 0x35, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0a, 0x0b, 0x0c, 0x0d, 0x0e, 0x0f, 0x10, 0x11, 0x12, 0x13, 0x14,
    0x15, 0x16, 0x17, 0x18, 0x19, 0x1a, 0x1b, 0x1c, 0x1d, 0x2f, 0x31, 0x30, 0x35, 0x7f};

static const uint8_t mk82UsbKeyboardShiftModifierTable[] = {
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x02, 0x02, 0x02, 0x02, 0x02,
    0x02, 0x02, 0x02, 0x02, 0x00, 0x02, 0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x02, 0x00, 0x02, 0x00, 0x02, 0x02, 0x02, 0x02, 0x02, 0x02, 0x02, 0x02, 0x02, 0x02, 0x02, 0x02, 0x02, 0x02,
    0x02, 0x02, 0x02, 0x02, 0x02, 0x02, 0x02, 0x02, 0x02, 0x02, 0x02, 0x02, 0x02, 0x02, 0x02, 0x00, 0x00, 0x00, 0x02,
    0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x02, 0x02, 0x02, 0x02, 0x00};
#endif /* FIRMWARE */

static void mk82UsbFatalError(void) { mk82SystemFatalError(); }

/*!
 * @brief CCID bulk in pipe callback function.
 *
 * This function serves as the callback function for CCID bulk in pipe.
 *
 * @param handle The USB device handle.
 * @param message The endpoint callback message
 * @param callbackParam The parameter of the callback.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
static usb_status_t USB_DeviceCcidBulkIn(usb_device_handle handle,
                                         usb_device_endpoint_callback_message_struct_t *message, void *callbackParam)
{
    usb_status_t error = kStatus_USB_Error;

    if ((message->length != 0) && (!(message->length % MK82_USB_CCID_BULK_ENDPOINTS_PACKET_SIZE)))
    {
        /* If the last packet is the size of endpoint, then send also zero-ended packet,
         ** meaning that we want to inform the host that we do not have any additional
         ** data, so it can flush the output.
         */
        USB_DeviceSendRequest(handle, MK82_USB_CCID_BULK_IN_ENDPOINT, NULL, 0);
        error = kStatus_USB_Success;
    }
    else
    {
        mk82UsbCcidDataSent = MK82_TRUE;
        error = kStatus_USB_Success;
    }

    return error;
}

/*!
 * @brief CCID bulk out pipe callback function.
 *
 * This function serves as the callback function for CCID bulk out pipe.
 *
 * @param handle The USB device handle.
 * @param message The endpoint callback message
 * @param callbackParam The parameter of the callback.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
static usb_status_t USB_DeviceCcidBulkOut(usb_device_handle handle,
                                          usb_device_endpoint_callback_message_struct_t *message, void *callbackParam)
{
    if (message->length == USB_UNINITIALIZED_VAL_32)
    {
        return kStatus_USB_Error;
    }

    mk82UsbCcidReceivedPacketLength = message->length;
    mk82UsbCcidPacketReceived = MK82_TRUE;
    return kStatus_USB_Success;
}

#ifdef FIRMWARE

/*!
 * @brief U2F interrupt in pipe callback function.
 *
 * This function serves as the callback function for U2F interrupt in pipe.
 *
 * @param handle The USB device handle.
 * @param message The endpoint callback message
 * @param callbackParam The parameter of the callback.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
static usb_status_t USB_DeviceU2fInterruptIn(usb_device_handle handle,
                                             usb_device_endpoint_callback_message_struct_t *message,
                                             void *callbackParam)
{
    usb_status_t error = kStatus_USB_Error;

