Secalot/secalot.firmware/platform/mk82/src/usb/mk82Usb.c
    mk82UsbU2fPacketSent = MK82_TRUE;
    error = kStatus_USB_Success;

    return error;
}

/*!
 * @brief U2F interrupt out pipe callback function.
 *
 * This function serves as the callback function for U2F interrupt out pipe.
 *
 * @param handle The USB device handle.
 * @param message The endpoint callback message
 * @param callbackParam The parameter of the callback.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
static usb_status_t USB_DeviceU2fInterruptOut(usb_device_handle handle,
                                              usb_device_endpoint_callback_message_struct_t *message,
                                              void *callbackParam)
{
    if (message->length != MK82_USB_U2F_INTERRUPT_ENDPOINTS_PACKET_SIZE)
    {
        if (message->length != USB_UNINITIALIZED_VAL_32)
        {
            mk82UsbFatalError();
        }
        else
        {
            return kStatus_USB_Error;
        }
    }

    mk82UsbU2fPacketReceived = MK82_TRUE;
    return kStatus_USB_Success;
}

/*!
 * @brief Keyboard interrupt in pipe callback function.
 *
 * This function serves as the callback function for U2F interrupt in pipe.
 *
 * @param handle The USB device handle.
 * @param message The endpoint callback message
 * @param callbackParam The parameter of the callback.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
static usb_status_t USB_DeviceKeyboardInterruptIn(usb_device_handle handle,
                                                  usb_device_endpoint_callback_message_struct_t *message,
                                                  void *callbackParam)
{
    usb_status_t error = kStatus_USB_Error;

    mk82UsbKeyboardPacketSent = MK82_TRUE;
    error = kStatus_USB_Success;

    return error;
}

/*!
 * @brief BTC interrupt in pipe callback function.
 *
 * This function serves as the callback function for BTC interrupt in pipe.
 *
 * @param handle The USB device handle.
 * @param message The endpoint callback message
 * @param callbackParam The parameter of the callback.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
static usb_status_t USB_DeviceBtcInterruptIn(usb_device_handle handle,
                                             usb_device_endpoint_callback_message_struct_t *message,
                                             void *callbackParam)
{
    usb_status_t error = kStatus_USB_Error;

    mk82UsbBtcPacketSent = MK82_TRUE;
    error = kStatus_USB_Success;

    return error;
}

/*!
 * @brief BTC interrupt out pipe callback function.
 *
 * This function serves as the callback function for BTC interrupt out pipe.
 *
 * @param handle The USB device handle.
 * @param message The endpoint callback message
 * @param callbackParam The parameter of the callback.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
static usb_status_t USB_DeviceBtcInterruptOut(usb_device_handle handle,
                                              usb_device_endpoint_callback_message_struct_t *message,
                                              void *callbackParam)
{
    if (message->length != MK82_USB_BTC_INTERRUPT_ENDPOINTS_PACKET_SIZE)
    {
        if (message->length != USB_UNINITIALIZED_VAL_32)
        {
            mk82UsbFatalError();
        }
        else
        {
            return kStatus_USB_Error;
        }
    }

    mk82UsbBtcPacketReceived = MK82_TRUE;
    return kStatus_USB_Success;
}

#endif /* FIRMWARE */

/*!
 * @brief Class specific callback function.
 *
 * This function handles class specific requests.
 *
 * @param handle The USB device handle.
 * @param setup The pointer to the setup packet.
 * @param length The pointer to the length of the data buffer.
 * @param buffer The pointer to the address of setup packet data buffer.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
usb_status_t USB_DeviceProcessClassRequest(usb_device_handle handle, usb_setup_struct_t *setup, uint32_t *length,
                                           uint8_t **buffer)
{
    usb_status_t error = kStatus_USB_InvalidRequest;

#ifdef FIRMWARE
    if (setup->wIndex == MK82_USB_KBD_INTERFACE_NUMBER)
    {
        switch (setup->bRequest)
        {
            case MK82_USB_DEVICE_HID_REQUEST_GET_REPORT:
                break;
            case MK82_USB_DEVICE_HID_REQUEST_GET_IDLE:
                break;
            case MK82_USB_DEVICE_HID_REQUEST_GET_PROTOCOL:
                break;
            case MK82_USB_DEVICE_HID_REQUEST_SET_REPORT:
                break;
            case MK82_USB_DEVICE_HID_REQUEST_SET_IDLE:
                error = kStatus_USB_Success;
                break;
            case MK82_USB_DEVICE_HID_REQUEST_SET_PROTOCOL:
                break;
            default:
                break;
        }
    }
#endif /* FIRMWARE */

    return error;
}

/*!
 * @brief USB device callback function.
 *
 * This function handles the usb device specific requests.
 *
 * @param handle          The USB device handle.
 * @param event           The USB device event type.
 * @param param           The parameter of the device specific request.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
usb_status_t USB_DeviceCallback(usb_device_handle handle, uint32_t event, void *param)
{
    usb_status_t error = kStatus_USB_Error;
    uint8_t *temp8 = (uint8_t *)param;

    switch (event)
    {
        case kUSB_DeviceEventBusReset:
        {
            USB_DeviceControlPipeInit(mk82UsbDeviceHandle);
        }
        break;
        case kUSB_DeviceEventSetConfiguration:
            if (param)
            {
                if (MK82_USB_DEFAULT_CONFIGURATION_VALUE == (*temp8))
                {
                    usb_device_endpoint_init_struct_t epInitStruct;
                    usb_device_endpoint_callback_struct_t endpointCallback;

                    /* CCID */

                    endpointCallback.callbackFn = USB_DeviceCcidBulkIn;
                    endpointCallback.callbackParam = handle;

                    epInitStruct.zlt = 0;
                    epInitStruct.transferType = USB_ENDPOINT_BULK;
                    epInitStruct.endpointAddress =
                        MK82_USB_CCID_BULK_IN_ENDPOINT | (USB_IN << USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT);
                    epInitStruct.maxPacketSize = MK82_USB_CCID_BULK_ENDPOINTS_PACKET_SIZE;

