Secalot/secalot.firmware/platform/mk82/src/usb/mk82Usb.c
                    USB_DeviceInitEndpoint(mk82UsbDeviceHandle, &epInitStruct, &endpointCallback);

                    endpointCallback.callbackFn = USB_DeviceCcidBulkOut;
                    endpointCallback.callbackParam = handle;

                    epInitStruct.zlt = 0;
                    epInitStruct.transferType = USB_ENDPOINT_BULK;
                    epInitStruct.endpointAddress =
                        MK82_USB_CCID_BULK_OUT_ENDPOINT | (USB_OUT << USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT);
                    epInitStruct.maxPacketSize = MK82_USB_CCID_BULK_ENDPOINTS_PACKET_SIZE;

                    USB_DeviceInitEndpoint(mk82UsbDeviceHandle, &epInitStruct, &endpointCallback);

#ifdef FIRMWARE
                    /* U2F */

                    endpointCallback.callbackFn = USB_DeviceU2fInterruptIn;
                    endpointCallback.callbackParam = handle;

                    epInitStruct.zlt = 0;
                    epInitStruct.transferType = USB_ENDPOINT_INTERRUPT;
                    epInitStruct.endpointAddress = MK82_USB_U2F_INTERRUPT_IN_ENDPOINT |
                                                   (USB_IN << USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT);
                    epInitStruct.maxPacketSize = MK82_USB_U2F_INTERRUPT_ENDPOINTS_PACKET_SIZE;

                    USB_DeviceInitEndpoint(mk82UsbDeviceHandle, &epInitStruct, &endpointCallback);

                    endpointCallback.callbackFn = USB_DeviceU2fInterruptOut;
                    endpointCallback.callbackParam = handle;

                    epInitStruct.zlt = 0;
                    epInitStruct.transferType = USB_ENDPOINT_INTERRUPT;
                    epInitStruct.endpointAddress = MK82_USB_U2F_INTERRUPT_OUT_ENDPOINT |
                                                   (USB_OUT << USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT);
                    epInitStruct.maxPacketSize = MK82_USB_U2F_INTERRUPT_ENDPOINTS_PACKET_SIZE;

                    USB_DeviceInitEndpoint(mk82UsbDeviceHandle, &epInitStruct, &endpointCallback);

                    /* Keyboard */

                    endpointCallback.callbackFn = USB_DeviceKeyboardInterruptIn;
                    endpointCallback.callbackParam = handle;

                    epInitStruct.zlt = 0;
                    epInitStruct.transferType = USB_ENDPOINT_INTERRUPT;
                    epInitStruct.endpointAddress = MK82_USB_KBD_INTERRUPT_IN_ENDPOINT |
                                                   (USB_IN << USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT);
                    epInitStruct.maxPacketSize = MK82_USB_KBD_INTERRUPT_ENDPOINT_PACKET_SIZE;

                    USB_DeviceInitEndpoint(mk82UsbDeviceHandle, &epInitStruct, &endpointCallback);

                    /* BTC */

                    endpointCallback.callbackFn = USB_DeviceBtcInterruptIn;
                    endpointCallback.callbackParam = handle;

                    epInitStruct.zlt = 0;
                    epInitStruct.transferType = USB_ENDPOINT_INTERRUPT;
                    epInitStruct.endpointAddress = MK82_USB_BTC_INTERRUPT_IN_ENDPOINT |
                                                   (USB_IN << USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT);
                    epInitStruct.maxPacketSize = MK82_USB_BTC_INTERRUPT_ENDPOINTS_PACKET_SIZE;

                    USB_DeviceInitEndpoint(mk82UsbDeviceHandle, &epInitStruct, &endpointCallback);

                    endpointCallback.callbackFn = USB_DeviceBtcInterruptOut;
                    endpointCallback.callbackParam = handle;

                    epInitStruct.zlt = 0;
                    epInitStruct.transferType = USB_ENDPOINT_INTERRUPT;
                    epInitStruct.endpointAddress = MK82_USB_BTC_INTERRUPT_OUT_ENDPOINT |
                                                   (USB_OUT << USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT);
                    epInitStruct.maxPacketSize = MK82_USB_BTC_INTERRUPT_ENDPOINTS_PACKET_SIZE;

                    USB_DeviceInitEndpoint(mk82UsbDeviceHandle, &epInitStruct, &endpointCallback);
#endif /* FIRMWARE */

                    USB_DeviceRecvRequest(handle, MK82_USB_CCID_BULK_OUT_ENDPOINT, mk82UsbCcidPacketBuffer,
                                          MK82_USB_CCID_BULK_ENDPOINTS_PACKET_SIZE);
#ifdef FIRMWARE
                    USB_DeviceRecvRequest(handle, MK82_USB_U2F_INTERRUPT_OUT_ENDPOINT, mk82UsbU2fIncomingPacketBuffer,
                                          MK82_USB_U2F_INTERRUPT_ENDPOINTS_PACKET_SIZE);
                    USB_DeviceRecvRequest(handle, MK82_USB_BTC_INTERRUPT_OUT_ENDPOINT, mk82UsbBtcIncomingPacketBuffer,
                                          MK82_USB_BTC_INTERRUPT_ENDPOINTS_PACKET_SIZE);
#endif /* FIRMWARE */

                    error = kStatus_USB_Success;
                }
            }
            break;
        default:
            break;
    }

    return error;
}

/*!
 * @brief Get the setup packet buffer.
 *
 * This function provides the buffer for setup packet.
 *
 * @param handle The USB device handle.
 * @param setupBuffer The pointer to the address of setup packet buffer.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
usb_status_t USB_DeviceGetSetupBuffer(usb_device_handle handle, usb_setup_struct_t **setupBuffer)
{
    static uint32_t setup[sizeof(usb_setup_struct_t)];
    if (NULL == setupBuffer)
    {
        return kStatus_USB_InvalidParameter;
    }
    *setupBuffer = (usb_setup_struct_t *)&setup;
    return kStatus_USB_Success;
}

/*!
 * @brief Get the setup packet data buffer.
 *
 * This function gets the data buffer for setup packet.
 *
 * @param handle The USB device handle.
 * @param setup The pointer to the setup packet.
 * @param length The pointer to the length of the data buffer.
 * @param buffer The pointer to the address of setup packet data buffer.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
usb_status_t USB_DeviceGetClassReceiveBuffer(usb_device_handle handle, usb_setup_struct_t *setup, uint32_t *length,
                                             uint8_t **buffer)
{
    static uint8_t setupOut[8];
    if ((NULL == buffer) || ((*length) > sizeof(setupOut)))
    {
        return kStatus_USB_InvalidRequest;
    }
    *buffer = setupOut;
    return kStatus_USB_Success;
}

/*!
 * @brief Configure remote wakeup feature.
 *
 * This function configures the remote wakeup feature.
 *
 * @param handle The USB device handle.
 * @param enable 1: enable, 0: disable.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
usb_status_t USB_DevcieConfigureRemoteWakeup(usb_device_handle handle, uint8_t enable)
{
    return kStatus_USB_InvalidRequest;
}

/*!
 * @brief USB configure endpoint function.
 *
 * This function configure endpoint status.
 *
 * @param handle The USB device handle.
 * @param ep Endpoint address.
 * @param status A flag to indicate whether to stall the endpoint. 1: stall, 0: unstall.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
usb_status_t USB_DevcieConfigureEndpointStatus(usb_device_handle handle, uint8_t ep, uint8_t status)
{
    if (status)
    {
        return USB_DeviceStallEndpoint(handle, ep);
    }
    else
    {
        return USB_DeviceUnstallEndpoint(handle, ep);
    }
}

