Secalot/secalot.firmware/platform/mk82/src/usb/mk82Usb.c
void USB0_IRQHandler(void) { USB_DeviceKhciIsrFunction(mk82UsbDeviceHandle); }

void PIT0_IRQHandler(void)
{
    uint8_t *wtxRequest;
    uint32_t wtxRequestLength;

    PIT_ClearStatusFlags(PIT0, kPIT_Chnl_0, PIT_TFLG_TIF_MASK);

    ccidCoreGetWTXRequest(&mk82UsbCcidHandle, &wtxRequest, &wtxRequestLength);

    mk82UsbCcidSendDataBlocking(wtxRequest, wtxRequestLength);
}

#ifdef FIRMWARE
void PIT1_IRQHandler(void)
{
    mk82UsbU2fTimerExpired = MK82_TRUE;

    PIT_StopTimer(PIT, kPIT_Chnl_1);
    PIT_ClearStatusFlags(PIT0, kPIT_Chnl_1, PIT_TFLG_TIF_MASK);
}
#endif /* FIRMWARE */

static void mk82UsbCcidSendDataBlocking(uint8_t *buffer, uint32_t bufferLength)
{
    usb_status_t error = kStatus_USB_Error;

    error = USB_DeviceSendRequest(mk82UsbDeviceHandle, MK82_USB_CCID_BULK_IN_ENDPOINT, buffer, bufferLength);

    if (error != kStatus_USB_Success)
    {
        mk82UsbFatalError();
    }

    while (mk82UsbCcidDataSent != MK82_TRUE)
    {
    };

    mk82UsbCcidDataSent = MK82_FALSE;
}

#ifdef FIRMWARE
static void mk82UsbU2fSendPacketBlocking(void)
{
    usb_status_t error = kStatus_USB_Error;

    error = USB_DeviceSendRequest(mk82UsbDeviceHandle, MK82_USB_U2F_INTERRUPT_IN_ENDPOINT,
                                  mk82UsbU2fOutgoingPacketBuffer, MK82_USB_U2F_INTERRUPT_ENDPOINTS_PACKET_SIZE);

    if (error != kStatus_USB_Success)
    {
        mk82UsbFatalError();
    }

    while (mk82UsbU2fPacketSent != MK82_TRUE)
    {
    };

    mk82UsbU2fPacketSent = MK82_FALSE;
}

static void mk82UsbKeyboardSendPacketBlocking(void)
{
    usb_status_t error = kStatus_USB_Error;

    error = USB_DeviceSendRequest(mk82UsbDeviceHandle, MK82_USB_KBD_INTERRUPT_IN_ENDPOINT,
                                  mk82UsbKeyboardOutgoingPacketBuffer, MK82_USB_KBD_INTERRUPT_ENDPOINT_PACKET_SIZE);

    if (error != kStatus_USB_Success)
    {
        mk82UsbFatalError();
    }

    while (mk82UsbKeyboardPacketSent != MK82_TRUE)
    {
    };

    mk82UsbKeyboardPacketSent = MK82_FALSE;
}

static void mk82UsbBtcSendPacketBlocking(void)
{
    usb_status_t error = kStatus_USB_Error;

    error = USB_DeviceSendRequest(mk82UsbDeviceHandle, MK82_USB_BTC_INTERRUPT_IN_ENDPOINT,
                                  mk82UsbBtcOutgoingPacketBuffer, MK82_USB_BTC_INTERRUPT_ENDPOINTS_PACKET_SIZE);

    if (error != kStatus_USB_Success)
    {
        mk82UsbFatalError();
    }

    while (mk82UsbBtcPacketSent != MK82_TRUE)
    {
    };

    mk82UsbBtcPacketSent = MK82_FALSE;
}
#endif /* FIRMWARE */

static uint16_t mk82UsbCheckForAnEvent(void)
{
    uint16_t retVal;

    if (mk82UsbCcidPacketReceived == MK82_TRUE)
    {
        mk82UsbCcidPacketReceived = MK82_FALSE;

        retVal = MK82_USB_EVENT_CCID_PACKET_RECEIVED;
    }
#ifdef FIRMWARE
    else if (mk82UsbU2fPacketReceived == MK82_TRUE)
    {
        mk82UsbU2fPacketReceived = MK82_FALSE;

        retVal = MK82_USB_EVENT_U2F_PACKET_RECEIVED;
    }
    else if (mk82UsbU2fTimerExpired == MK82_TRUE)
    {
        mk82UsbU2fTimerExpired = MK82_FALSE;

        retVal = MK82_USB_EVENT_U2F_TIMER_EXPIRED;
    }
    else if (mk82UsbBtcPacketReceived == MK82_TRUE)
    {
        mk82UsbBtcPacketReceived = MK82_FALSE;

        retVal = MK82_USB_EVENT_BTC_PACKET_RECEIVED;
    }
#endif /* FIRMWARE */
    else
    {
        retVal = MK82_USB_EVENT_NOTHING_HAPPENED;
    }

    return retVal;
}

void mk82UsbInit(void)
{
    uint8_t histChars[MK82_USB_MAX_HISTCHARS_LENGTH];
    uint32_t histCharsLength = 0;

#ifdef FIRMWARE
    opgpCoreGetHistChars(histChars, &histCharsLength);
#endif /* FIRMWARE */

    ccidCoreInit(&mk82UsbCcidHandle, mk82UsbCcidDataBuffer, histChars, histCharsLength);

#ifdef FIRMWARE
    sfHidInit(&mk82UsbSfHidHandle, mk82UsbU2fHidDataBuffer);
    btcHidInit(&mk82UsbBtcHidHandle, mk82UsbBtcHidDataBuffer);
#endif /* FIRMWARE */

    SystemCoreClockUpdate();

    CLOCK_EnableUsbfs0Clock(kCLOCK_UsbSrcIrc48M, 48000000U);

    if (kStatus_USB_Success != USB_DeviceInit(kUSB_ControllerKhci0, USB_DeviceCallback, &mk82UsbDeviceHandle))
    {
        mk82UsbFatalError();
    }

    MPU_Enable(MPU, 0);

    NVIC_SetPriority(USB0_IRQn, MK82_USB_DEVICE_INTERRUPT_PRIORITY);
    NVIC_EnableIRQ(USB0_IRQn);

    USB_DeviceRun(mk82UsbDeviceHandle);

    PIT_SetTimerPeriod(PIT0, kPIT_Chnl_0, MSEC_TO_COUNT(CCID_WTX_TIMEOUT_IN_MS, CLOCK_GetFreq(kCLOCK_BusClk)));
    PIT_EnableInterrupts(PIT0, kPIT_Chnl_0, kPIT_TimerInterruptEnable);
    NVIC_SetPriority(PIT0_IRQn, MK82_PIT_WTX_INTERRUPT_PRIORITY);
    NVIC_EnableIRQ(PIT0_IRQn);

#ifdef FIRMWARE
    PIT_SetTimerPeriod(PIT0, kPIT_Chnl_1, MSEC_TO_COUNT(SF_HID_TIMER_TIMEOUT_IN_MS, CLOCK_GetFreq(kCLOCK_BusClk)));
    PIT_EnableInterrupts(PIT0, kPIT_Chnl_1, kPIT_TimerInterruptEnable);
    NVIC_SetPriority(PIT1_IRQn, MK82_PIT_U2F_INTERRUPT_PRIORITY);
    NVIC_EnableIRQ(PIT1_IRQn);
#endif /* FIRMWARE */
}

uint16_t mk82UsbCheckForNewCommand(uint8_t **data, uint32_t *dataLength, uint16_t *dataType)
{
    uint16_t event;
    uint16_t newCommandReceived = MK82_USB_COMMAND_NOT_RECEIVED;

    if ((data == NULL) || (dataLength == NULL))
    {
        mk82UsbFatalError();
    }

    event = mk82UsbCheckForAnEvent();

    if (event == MK82_USB_EVENT_CCID_PACKET_RECEIVED)
    {
        uint16_t requiredAction;

        ccidCoreProcessIncomingPacket(&mk82UsbCcidHandle, mk82UsbCcidPacketBuffer, mk82UsbCcidReceivedPacketLength,
                                      &requiredAction);

        if (requiredAction == CCID_CORE_ACTION_SEND_RESPOSE)
        {
            uint8_t *response;
            uint32_t responseLength;

            ccidCoreGetResponse(&mk82UsbCcidHandle, &response, &responseLength);

            mk82UsbCcidSendDataBlocking(response, responseLength);

            ccidCoreResponseSent(&mk82UsbCcidHandle);

            USB_DeviceRecvRequest(mk82UsbDeviceHandle, MK82_USB_CCID_BULK_OUT_ENDPOINT, mk82UsbCcidPacketBuffer,
                                  MK82_USB_CCID_BULK_ENDPOINTS_PACKET_SIZE);
        }
        else if (requiredAction == CCID_CORE_ACTION_PROCESS_RECEIVED_APDU)
        {
            ccidCoreGetAPDU(&mk82UsbCcidHandle, data, dataLength);

            PIT_StartTimer(PIT, kPIT_Chnl_0);

            *dataType = MK82_USB_DATATYPE_CCID_APDU;

            newCommandReceived = MK82_USB_COMMAND_RECEIVED;
        }
        else if (requiredAction == CCID_CORE_ACTION_DO_NOTHING)
        {
            USB_DeviceRecvRequest(mk82UsbDeviceHandle, MK82_USB_CCID_BULK_OUT_ENDPOINT, mk82UsbCcidPacketBuffer,
                                  MK82_USB_CCID_BULK_ENDPOINTS_PACKET_SIZE);
        }
        else
        {
            mk82UsbFatalError();
        }
    }
#ifdef FIRMWARE
    else if (event == MK82_USB_EVENT_U2F_PACKET_RECEIVED)
    {
        uint16_t requiredPostFrameProcessingAction;
        uint16_t timerAction;

        sfHidProcessIncomingFrame(&mk82UsbSfHidHandle, mk82UsbU2fIncomingPacketBuffer, mk82UsbU2fOutgoingPacketBuffer,
                                  &requiredPostFrameProcessingAction, &timerAction);

