Secalot/secalot.firmware/platform/mk82/src/usb/mk82Usb.c
        if (timerAction == SF_HID_TIMER_ACTION_START)
        {
            PIT_StopTimer(PIT, kPIT_Chnl_1);
            mk82UsbU2fTimerExpired = MK82_FALSE;
            PIT_StartTimer(PIT, kPIT_Chnl_1);
        }
        else if (timerAction == SF_HID_TIMER_ACTION_STOP)
        {
            PIT_StopTimer(PIT, kPIT_Chnl_1);
            mk82UsbU2fTimerExpired = MK82_FALSE;
        }
        else if (timerAction == SF_HID_TIMER_ACTION_DO_NOTHING)
        {
        }
        else
        {
            mk82UsbFatalError();
        }

        if (requiredPostFrameProcessingAction == SF_HID_ACTION_SEND_IMMEDIATE_OUTGOING_FRAME)
        {
            mk82UsbU2fSendPacketBlocking();
            USB_DeviceRecvRequest(mk82UsbDeviceHandle, MK82_USB_U2F_INTERRUPT_OUT_ENDPOINT,
                                  mk82UsbU2fIncomingPacketBuffer, MK82_USB_U2F_INTERRUPT_ENDPOINTS_PACKET_SIZE);
        }
        else if (requiredPostFrameProcessingAction == SF_HID_ACTION_PROCESS_RECEIVED_COMMAND)
        {
            uint16_t incomingCommand;
            uint16_t incomingCommandLength;

            sfHidGetIncomingCommandAndDataSize(&mk82UsbSfHidHandle, &incomingCommand, &incomingCommandLength);

            if (incomingCommand == SF_HID_COMMAND_CODE_APDU)
            {
                *data = mk82UsbU2fHidDataBuffer;
                *dataLength = (uint16_t)incomingCommandLength;
                *dataType = MK82_USB_DATATYPE_U2F_MESSAGE;

                newCommandReceived = MK82_USB_COMMAND_RECEIVED;
            }
            else if (incomingCommand == SF_HID_COMMAND_CODE_PING)
            {
                uint16_t moreFramesAvailable;

                sfHidSetOutgoingDataLength(&mk82UsbSfHidHandle, incomingCommandLength);

                do
                {
                    sfHidProcessOutgoingData(&mk82UsbSfHidHandle, mk82UsbU2fOutgoingPacketBuffer, &moreFramesAvailable);

                    mk82UsbU2fSendPacketBlocking();

                } while (moreFramesAvailable == SF_TRUE);

                USB_DeviceRecvRequest(mk82UsbDeviceHandle, MK82_USB_U2F_INTERRUPT_OUT_ENDPOINT,
                                      mk82UsbU2fIncomingPacketBuffer, MK82_USB_U2F_INTERRUPT_ENDPOINTS_PACKET_SIZE);
            }
            else
            {
                mk82UsbFatalError();
            }
        }
        else if (requiredPostFrameProcessingAction == SF_HID_ACTION_DO_NOTHING)
        {
            USB_DeviceRecvRequest(mk82UsbDeviceHandle, MK82_USB_U2F_INTERRUPT_OUT_ENDPOINT,
                                  mk82UsbU2fIncomingPacketBuffer, MK82_USB_U2F_INTERRUPT_ENDPOINTS_PACKET_SIZE);
        }
        else
        {
            mk82UsbFatalError();
        }
    }
    else if (event == MK82_USB_EVENT_U2F_TIMER_EXPIRED)
    {
        sfHidTimeoutHandler(&mk82UsbSfHidHandle, mk82UsbU2fOutgoingPacketBuffer);

        mk82UsbU2fSendPacketBlocking();
    }
    else if (event == MK82_USB_EVENT_BTC_PACKET_RECEIVED)
    {
        uint16_t requiredPostFrameProcessingAction;

        btcHidProcessIncomingFrame(&mk82UsbBtcHidHandle, mk82UsbBtcIncomingPacketBuffer,
                                   &requiredPostFrameProcessingAction);

        if (requiredPostFrameProcessingAction == BTC_HID_ACTION_PROCESS_RECEIVED_COMMAND)
        {
            uint16_t incomingDataSize;

            btcHidGetIncomingDataSize(&mk82UsbBtcHidHandle, &incomingDataSize);

            *data = mk82UsbBtcHidDataBuffer;
            *dataLength = (uint16_t)incomingDataSize;
            *dataType = MK82_USB_DATATYPE_BTC_MESSAGE;

            newCommandReceived = MK82_USB_COMMAND_RECEIVED;
        }
        else if (requiredPostFrameProcessingAction == SF_HID_ACTION_DO_NOTHING)
        {
            USB_DeviceRecvRequest(mk82UsbDeviceHandle, MK82_USB_BTC_INTERRUPT_OUT_ENDPOINT,
                                  mk82UsbBtcIncomingPacketBuffer, MK82_USB_BTC_INTERRUPT_ENDPOINTS_PACKET_SIZE);
        }
        else
        {
            mk82UsbFatalError();
        }
    }
#endif /* FIRMWARE */
    else if (event == MK82_USB_EVENT_NOTHING_HAPPENED)
    {
    }
    else
    {
        mk82UsbFatalError();
    }

    return newCommandReceived;
}

void mk82UsbSendResponse(uint32_t dataLength, uint16_t dataType)
{
    if (dataType == MK82_USB_DATATYPE_CCID_APDU)
    {
        uint8_t *response;
        uint32_t responseLength;

        PIT_StopTimer(PIT, kPIT_Chnl_0);

        ccidCorePrepareResponseAPDU(&mk82UsbCcidHandle, dataLength, &response, &responseLength);

        mk82UsbCcidSendDataBlocking(response, responseLength);

        ccidCoreResponseSent(&mk82UsbCcidHandle);

        USB_DeviceRecvRequest(mk82UsbDeviceHandle, MK82_USB_CCID_BULK_OUT_ENDPOINT, mk82UsbCcidPacketBuffer,
                              MK82_USB_CCID_BULK_ENDPOINTS_PACKET_SIZE);
    }
#ifdef FIRMWARE
    else if (dataType == MK82_USB_DATATYPE_U2F_MESSAGE)
    {
        uint16_t moreFramesAvailable;

        sfHidSetOutgoingDataLength(&mk82UsbSfHidHandle, dataLength);

        do
        {
            sfHidProcessOutgoingData(&mk82UsbSfHidHandle, mk82UsbU2fOutgoingPacketBuffer, &moreFramesAvailable);

            mk82UsbU2fSendPacketBlocking();

        } while (moreFramesAvailable == SF_TRUE);

        USB_DeviceRecvRequest(mk82UsbDeviceHandle, MK82_USB_U2F_INTERRUPT_OUT_ENDPOINT, mk82UsbU2fIncomingPacketBuffer,
                              MK82_USB_U2F_INTERRUPT_ENDPOINTS_PACKET_SIZE);
    }
    else if (dataType == MK82_USB_DATATYPE_BTC_MESSAGE)
    {
        uint16_t moreFramesAvailable;

        btcHidSetOutgoingDataLength(&mk82UsbBtcHidHandle, dataLength);

        do
        {
            btcHidProcessOutgoingData(&mk82UsbBtcHidHandle, mk82UsbBtcOutgoingPacketBuffer, &moreFramesAvailable);

            mk82UsbBtcSendPacketBlocking();

        } while (moreFramesAvailable == SF_TRUE);

        USB_DeviceRecvRequest(mk82UsbDeviceHandle, MK82_USB_BTC_INTERRUPT_OUT_ENDPOINT, mk82UsbBtcIncomingPacketBuffer,
                              MK82_USB_BTC_INTERRUPT_ENDPOINTS_PACKET_SIZE);
    }
#endif /* FIRMWARE */
    else
    {
        mk82UsbFatalError();
    }
}

#ifdef FIRMWARE
void mk82UsbTypeStringWithAKeyboard(uint8_t *stringToType, uint32_t stringLength)
{
    MK82_USB_KEYBOARD_INPUT_REPORT *report = (MK82_USB_KEYBOARD_INPUT_REPORT *)mk82UsbKeyboardOutgoingPacketBuffer;
    uint32_t i;

    for (i = 0; i < stringLength; i++)
    {
        if (stringToType[i] < sizeof(mk82UsbKeyboardKeyTable))
        {
            mk82SystemMemSet((uint8_t *)report, 0x00, sizeof(MK82_USB_KEYBOARD_INPUT_REPORT));

            report->keyModifier = mk82UsbKeyboardShiftModifierTable[stringToType[i]];
            report->pressedKeys[0] = mk82UsbKeyboardKeyTable[stringToType[i]];

            mk82UsbKeyboardSendPacketBlocking();

            mk82SystemMemSet((uint8_t *)report, 0x00, sizeof(MK82_USB_KEYBOARD_INPUT_REPORT));

            mk82UsbKeyboardSendPacketBlocking();
        }
    }
}
#endif /* FIRMWARE */
